/*
    Продукты питания и их кбжу при разных способах готовки
*/

% Калории, Белки, Жиры, Углеводы
food("chiken", 165,	31, 3.6, 0.0).
food("broccoli", 34, 3.0, 0.28, 0.0).
food("salmon", 206, 22.0, 13.0, 0.0).
food("Eggs", 155, 13.0, 11.0, 1.1).
food("tofu", 144, 15.0, 8.0, 3.9).
food("rice", 130, 2.7, 0.3, 28.0).

% жарка, варка, запекание, пар
cooking("fried", 1.2, 0.95, 1.5, 0.9).
cooking("boiled", 0.85, 0.98, 0.8, 0.95).
cooking("baking", 1.1, 0.98, 1.2, 0.95).
cooking("steam", 0.9, 0.99, 0.85, 0.98).

kbju_after_cooking(Продукт, Способ, Калории, Белки, Жиры, Углеводы) :-
    food(Продукт, КалорииСыр, БелкиСыр, ЖирыСыр, УглеводыСыр),
    cooking(Способ, ИзмКалорий, ИзмБелков, ИзмЖиров, ИзмУглеводов),
    Калории is КалорииСыр * ИзмКалорий,
    Белки is БелкиСыр * ИзмБелков,
    Жиры is ЖирыСыр * ИзмЖиров,
    Углеводы is УглеводыСыр * ИзмУглеводов.


% ?- food("rice", A,B,C,D).
% ?- kbju_after_cooking("chiken", "fried", A, B, C, D).